In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [2]:
%%sql
SELECT * 
FROM sqlite_master
WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'facts', 'facts', 2, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (50 characters truncated) ... on" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float, "created_at" datetime, "updated_at" datetime)'),
 ('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)')]

In [3]:
%%sql
SELECT * 
FROM facts
LIMIT 5

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51, '2015-11-01 13:19:49.461734', '2015-11-01 13:19:49.461734'),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3, '2015-11-01 13:19:54.431082', '2015-11-01 13:19:54.431082'),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92, '2015-11-01 13:19:59.961286', '2015-11-01 13:19:59.961286'),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0, '2015-11-01 13:20:03.659945', '2015-11-01 13:20:03.659945'),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46, '2015-11-01 13:20:08.625072', '2015-11-01 13:20:08.625072')]

In [5]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [6]:
%%sql 
SELECT name
FROM facts 
WHERE population==0

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

In [8]:
%%sql 
SELECT name
FROM facts 
WHERE population==7256490011

 * sqlite:///factbook.db
Done.

[('World',)]

In [10]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts
WHERE name IS NOT 'World'

 * sqlite:///factbook.db
Done.

[(0, 1367485388, 0.0, 4.02)]

In [11]:
%%sql
SELECT AVG(population), AVG(area)
FROM facts

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

In [12]:
%%sql
SELECT name, population, area
FROM facts
WHERE population> (SELECT AVG(population) FROM facts) 
AND area >(SELECT AVG(area) FROM facts)

 * sqlite:///factbook.db
Done.

[('Brazil', 204259812, 8515770),
 ('China', 1367485388, 9596960),
 ('Congo, Democratic Republic of the', 79375136, 2344858),
 ('Egypt', 88487396, 1001450),
 ('Ethiopia', 99465819, 1104300),
 ('France', 66553766, 643801),
 ('India', 1251695584, 3287263),
 ('Indonesia', 255993674, 1904569),
 ('Iran', 81824270, 1648195),
 ('Mexico', 121736809, 1964375),
 ('Nigeria', 181562056, 923768),
 ('Pakistan', 199085847, 796095),
 ('Russia', 142423773, 17098242),
 ('Turkey', 79414269, 783562),
 ('United States', 321368864, 9826675),
 ('European Union', 513949445, 4324782)]